01  WS-SUM     PIC 9(5) OCCURS 100 TIMES.
01  WS-COUNTER PIC 9(3).
01  WS-SUM-TOTAL PIC 9(5) VALUE 0.

PROCEDURE DIVISION.
    PERFORM VARYING WS-COUNTER FROM 1 BY 1 UNTIL WS-COUNTER > 100
        ADD WS-COUNTER TO WS-SUM-TOTAL
    END-PERFORM.
    DISPLAY "Sum is:" WS-SUM-TOTAL.
    STOP RUN.